CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_cau_aes.c
        /* AES calculate process */
        ret = cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        if(ERROR == ret){
            return ret; 
        }    
    }
    
    /*========================= tag phase=======================*/
    /* select tag phase */
    cau_phase_config(CAU_TAG_PHASE);
    /* flush the IN and OUT FIFOs */
    cau_fifo_flush();     
    /* enable the CAU peripheral */
    cau_enable();

    if(DISABLE == cau_enable_state_get()){
        return ERROR;    
    }
    
    cau_data_write(__REV(aadlength_h));
    cau_data_write(__REV(aadlength_l));
    cau_data_write(__REV(inputlength_h));
    cau_data_write(__REV(inputlength_l));
    
    /* wait until the ONE flag is set */
    while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)){
    }

    /* read the tag in the OUT FIFO */
    *(uint32_t*)(tagaddr) = cau_data_read();
    tagaddr += 4U;
    *(uint32_t*)(tagaddr) = cau_data_read();
    tagaddr += 4U;
    *(uint32_t*)(tagaddr) = cau_data_read();
    tagaddr += 4U;
    *(uint32_t*)(tagaddr) = cau_data_read();
    tagaddr += 4U;    

    /* disable the CAU peripheral */
    cau_disable();

    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in CCM mode
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT 
                  key: key (in bytes)
                  key_size: key size in bytes, must be either 128, 192 or 256
                  iv: initialization vector (in bytes)
                  iv_size: iv size in bytes, must be 7 - 13
                  input: input data (in bytes)
                  in_length: input data length in bytes, must be a multiple of 16 bytes
                  aad: additional authentication data [in & out] (in bytes)
                  aad_size: aad size [in & out] (in bytes)
    \param[in]  tag_size: tag size (in bytes)
    \param[out] output: pointer to the returned output data buffer
    \param[out] tag: pointer to the returned tag buffer
    \param[out] aad_buf: pointer to the user buffer used when formatting aad block
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_ccm(cau_parameter_struct *cau_parameter, uint8_t *output, uint8_t tag[], uint32_t tag_size, uint8_t aad_buf[])
{
    ErrStatus ret = ERROR;
    cau_key_parameter_struct key_initpara;
    cau_iv_parameter_struct iv_initpara;
    uint32_t inputaddr  = (uint32_t)cau_parameter->input;
    uint32_t inputsize = cau_parameter->in_length;
    uint32_t aadaddr = (uint32_t)cau_parameter->aad;    
    uint32_t aadsize = cau_parameter->aad_size;
    uint32_t ivaddr = (uint32_t)cau_parameter->iv;
    uint32_t ivsize = cau_parameter->iv_size;
    uint32_t temptag[4] = {0U};
    uint32_t outputaddr = (uint32_t)output;
    uint32_t i = 0U, plen = 0U;
    uint32_t head_index = 0U;
    uint8_t blockb0[16U] = {0U};
    uint8_t counter[16U] = {0U};
    uint32_t ctraddr = (uint32_t)counter;
    uint32_t b0addr = (uint32_t)blockb0;    

    /*===============formatting the aad block=================*/
    if((uint32_t)0 != aadsize){
        /* check that the aad length is lower than 2^16 - 2^8 = 65536 - 256 = 65280 */
        if(aadsize < 65280U){
            aad_buf[head_index++] = (uint8_t) ((aadsize >> 8U) & 0xFFU);
            aad_buf[head_index++] = (uint8_t) ((aadsize) & 0xFFU);
            aadsize += 2U;
        }else{
            /* aad is encoded as 0xff || 0xfe || [aadsize]32, i.e., six octets */
            aad_buf[head_index++] = 0xFFU;
            aad_buf[head_index++] = 0xFEU;
            aad_buf[head_index++] = (uint8_t)((aadsize & 0xff000000U) >> 24U);
            aad_buf[head_index++] = (uint8_t)((aadsize & 0x00ff0000U) >> 16U);
            aad_buf[head_index++] = (uint8_t)((aadsize & 0x0000ff00U) >> 8U);
            aad_buf[head_index++] = (uint8_t)(aadsize & 0x000000ffU);
            aadsize += 6U;
        }
        /* Copy the aad buffer in internal buffer "HBuffer" */
        for(i = 0U; i < aadsize; i++){
            aad_buf[head_index++] = *(uint8_t*)((uint32_t)(aadaddr + i));
        }
        /* Check if the aad size is modulo 16 */
        if ((aadsize % 16U) != 0U){
            /* pad the aad buffer with 0s till the aad_buf length is multiple of 16 */
            for(i = aadsize; i <= ((aadsize/16U) + 1U) * 16U; i++){
                aad_buf[i] = 0U;
            }
            /* Set the aad size to multiple of 16 */
            aadsize = ((aadsize/16U) + 1U) * 16U;
        }
        /* set the pointer aadaddr to aad_buf */
        aadaddr = (uint32_t)aad_buf;
    }    
    /*=================formatting the block B0===================*/
    if(aadsize != 0U){
        blockb0[0U] = 0x40U;
    }
    
    /* the byte length for payload length expressing, which plus the ivsize must equal to 15 bytes */
    plen = 15U - ivsize;
    /* flags byte */
    blockb0[0] |= 0U | (((((uint8_t)tag_size - 2U) / 2U) & 0x07U) << 3U) | (((uint8_t)plen - 1U) & 0x07U);
  
    for(i = 0U; i < ivsize; i++){
      blockb0[i+1U] = *(uint8_t*)((uint32_t)(ivaddr + i));
    }
    
    /* if the byte length for payload length expressing is more than 4 bytes */
    if(plen > 4U){
        /* pad the blockb0 after vectors, and before the last 4 bytes */
        for( ; i < 11U; i++){
            blockb0[i+1U] = 0U;
        }
        blockb0[12U] = (uint8_t)((inputsize >> 24U) & 0xFFU);
        blockb0[13U] = (uint8_t)((inputsize >> 16U) & 0xFFU); 
        blockb0[14U] = (uint8_t)((inputsize >> 8U) & 0xFFU);
        blockb0[15U] = (uint8_t)(inputsize & 0xFFU);        
    }else{
        /* the payload length is expressed in plen bytes */
        for( ; i < 15U; i++){
            blockb0[i+1U] = (uint8_t)((inputsize >> ((plen - 1U) * 8U)) & 0xFFU);
            plen--;
        }
    }
  
    /*=======formatting the counter CTR1 for encryption/decription=======*/
    /* byte 0: bits 0-2 contain the same encoding of q as in B0 */    
    counter[0] = blockb0[0] & BLOCK_B0_MASK;
    for(i = 1U; i < ivsize + 1U; i++){
        counter[i] = blockb0[i];
    }
    /* counter CTR1 is initialized to 1 */
    counter[15] |= 0x01U;   
    
    /*========================= prepare phase=========================*/
    /* flush the IN and OUT FIFOs */
    cau_fifo_flush();    
    /* clear CAUEN bit to ensure CAU is disable */
    cau_disable();
    
    /* key structure initialization */
    cau_key_struct_para_init(&key_initpara);
    /* initialize the CAU peripheral */
    cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CCM, CAU_SWAPPING_8BIT);  
    /* select prepare phase */
    cau_phase_config(CAU_PREPARE_PHASE);
  
    /* AES key structure parameter config */
    cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
    /* key initialization */
    cau_key_init(&key_initpara);
  
    /* vectors initialization */
    iv_initpara.iv_0_high = __REV(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    iv_initpara.iv_0_low = __REV(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    iv_initpara.iv_1_high = __REV(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    iv_initpara.iv_1_low = __REV(*(uint32_t*)(ctraddr));
    cau_iv_init(&iv_initpara);

    /* enable the CAU peripheral */
    cau_enable();    
    
    /* write block B0 in the In FIFO */
    cau_data_write(*(uint32_t*)(b0addr));
    b0addr += 4U;
    cau_data_write(*(uint32_t*)(b0addr));
    b0addr += 4U;
    cau_data_write(*(uint32_t*)(b0addr));
    b0addr += 4U;
    cau_data_write(*(uint32_t*)(b0addr));
    
