CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_cau_aes.c
    /* wait for CAUEN bit to be 0 */
    while(ENABLE == cau_enable_state_get()){
    }

    /*========================= AAD phase=======================*/
    if((uint32_t)0U != aadsize){
        /* select AAD phase */
        cau_phase_config(CAU_AAD_PHASE);
        /* enable the CAU peripheral */
        cau_enable();
        
        ret = cau_fill_data((uint8_t*)aadaddr, aadsize);

        if(ERROR == ret){
            return ret;
        }    
    }
    
    /*========================= encryption/decryption phase=======================*/
    if((uint32_t)0U != inputsize){
        /* select encryption/decryption phase */
        cau_phase_config(CAU_ENCRYPT_DECRYPT_PHASE);
        /* enable the CAU peripheral */
        cau_enable();
        
        /* AES calculate process */
        ret = cau_aes_calculate((uint8_t*)inputaddr, inputsize, (uint8_t*)outputaddr);

        if(ERROR == ret){
            return ret;   
        }    
    }
    
    /*========================= tag phase=======================*/
    /* select tag phase */
    cau_phase_config(CAU_TAG_PHASE);
    /* enable the CAU peripheral */
    cau_enable();

    if(DISABLE == cau_enable_state_get()){
        return ERROR;    
    }
    
    ctraddr = (uint32_t)counter;
    
    cau_data_write(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    cau_data_write(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    cau_data_write(*(uint32_t*)(ctraddr));
    ctraddr += 4U;
    /* reset bit 0 (after 8-bit swap) is equivalent to reset bit 24 (before 8-bit swap) */
    cau_data_write(*(uint32_t*)(ctraddr) & 0xfeffffffU);

    /* wait until the ONE flag is set */
    while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)){
    }

    /* read the tag in the OUT FIFO */
    temptag[0U] = cau_data_read();
    temptag[1U] = cau_data_read();
    temptag[2U] = cau_data_read();
    temptag[3U] = cau_data_read(); 
    
    for(i = 0U; i < tag_size; i++){
/*        tag[i] = *((uint8_t*)temptag + i);*/
        tag[i] = (uint8_t)(temptag[i/4U] >> (8U * (i % 4U)));
    }

    /* disable the CAU peripheral */
    cau_disable();

    return ret;
}
/*!
    \brief      AES key structure parameter config
    \param[in]  key: key used for AES algorithm (in bytes)
    \param[in]  keysize: length of the key in bits, must be either 128, 192 or 256 
    \param[out] cau_key_initpara: key init parameter struct
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
    \retval     none
*/
static void cau_aes_key_config(uint8_t *key, uint32_t keysize, cau_key_parameter_struct* cau_key_initpara)
{
    uint32_t keyaddr = (uint32_t)key;
  
    switch(keysize){
    case 128:        
        cau_aes_keysize_config(CAU_KEYSIZE_128BIT);
        cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
        break;
    case 192:
        cau_aes_keysize_config(CAU_KEYSIZE_192BIT);
        cau_key_initpara->key_1_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
        break;
    case 256:
        cau_aes_keysize_config(CAU_KEYSIZE_256BIT);
        cau_key_initpara->key_0_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_0_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_1_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
        keyaddr += 4U;
        cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
        break;
    default:
        break;
    }
}

/*!
    \brief      fill data into data input register
    \param[in]  input: pointer to the input buffer (in bytes)    
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes    
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_fill_data(uint8_t *input, uint32_t in_length)
{
    uint32_t inputaddr  = (uint32_t)input;
    uint32_t i = 0U;
    __IO uint32_t counter = 0U;
    uint32_t busystatus = 0U;

    if(DISABLE == cau_enable_state_get()){
        return ERROR;
    }
        
    for(i = 0U; i < in_length; i += 16U){    
        /* wait until the IEM flag is set */
        while(RESET == cau_flag_get(CAU_FLAG_INFIFO_EMPTY)){
        }

        /* write data to the IN FIFO */
        cau_data_write(*(uint32_t*)(inputaddr));
        inputaddr += 4U;
        cau_data_write(*(uint32_t*)(inputaddr));
        inputaddr += 4U;
        cau_data_write(*(uint32_t*)(inputaddr));
        inputaddr += 4U;
        cau_data_write(*(uint32_t*)(inputaddr));
        inputaddr += 4U;      
    }
    /* wait until the complete message has been processed */
    counter = 0U;
    do{        
        busystatus = cau_flag_get(CAU_FLAG_BUSY);
        counter++;
    }while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));  
   
    if(RESET != busystatus){       
        return ERROR;
    }
    
    return SUCCESS;
}

/*!
    \brief      AES calculate process
    \param[in]  input: pointer to the input buffer     
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes  
    \param[out]  output: pointer to the returned buffer    
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_aes_calculate(uint8_t *input, uint32_t in_length, uint8_t *output)
{
    uint32_t inputaddr  = (uint32_t)input;
    uint32_t outputaddr = (uint32_t)output;
    uint32_t i = 0U;
    __IO uint32_t counter = 0U;
    uint32_t busystatus = 0U;  
  
